Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: This means the tag directly above is an annotated tag and that line is the commit that the annotated tag points to.
es: Esto nos indica que la etiqueta inmediatamente anterior es una etiqueta anotada y que esa línea es la confirmación de cambios a la que apunta dicha etiqueta anotada.

source: Insert 18333fig0336.png Figure 3-36.
es: Insert 18333fig0336.png Figura 3-36.

source: All they have to do is copy the contents of the `.pub` file and e-mail it.
es: Esto se puede realizar simplemente copiando los contenidos del archivo terminado en '.pub' y enviandoselos por correo electrónico.

source: This is a very common workflow with sites like GitHub, where it’s easy to fork a project and push your changes into your fork for everyone to see.
es: Esta es una forma de trabajo muy común en sitios tales como GitHub, donde es sencillo bifurcar (fork) un proyecto y enviar tus cambios a tu copia, donde cualquiera puede verlos.

source: To do so, change the word pick to the word edit for each of the commits you want the script to stop after.
es: Y se ha de cambiar la palabra 'pick' por la palabra 'edit' en cada una de las confirmaciones de cambio donde se desee detener el script.

source: The Network tab shows all the people who have forked your project and contributed back.
es: La pestaña "Network" muestra una lista de toda la gente que ha bifurcado (forked) tu proyecto y ha contribuido a él.

source: It’s important to note that this is literally all you need to do to run a useful Git server to which several people have access — just add SSH-able accounts on a server, and stick a bare repository somewhere that all those users have read and write access to.
es: Es importante destacar que esto es, literalmente, todo lo necesario para preparar un servidor Git compartido. Habilitar unas cuantas cuentas SSH en un servidor; colocar un repositorio básico en algún lugar donde esos usuarios tengan acceso de lectura/escritura;

source: ### Checking Out Remote Branches ###
es: ### Recuperando ramas remotas ###

source: If you have any issues, it may be useful to add `loglevel=DEBUG` under the `[gitosis]` section.
es: Si tienes problemas, puede ser util añadir `loglevel=DEBUG` en la sección `[gitosis]`.

source: These are the core parts of Git.
es: Estos elementos forman el núcleo de Git.

source: You should only have to use `git apply` for legacy patches and things like that.
es: Solo deberías utilizar 'git apply' en caso de parches antiguos y similares.

source: You do this with the `git branch` command:
es: Usarás el comando 'git branch':

source: Next, Gitosis wants to put its repositories under `/home/git`, which is fine.
es: Gitosis intentará instalar sus repositorios bajo la carpeta '/home/git', lo cual está bien.

source: You can also use this string as the target of a checkout or show command, although it relies on the abbreviated SHA-1 value at the end, so it may not be valid forever.
es: Tambien puedes utilizar esta descripción para indicar lo que deseas activar (checkout) o mostrar (show); pero realmente estarás usando solamente la parte final de la firma SHA-1 abreviada, por lo que no siempre será válida.

source: Next, you’ll see how to work the other side of the coin: maintaining a Git project.
es: A continuación veremos cómo trabajar en el otro lado de la moneda: manteniendo y gestionando un proyecto Git.

source: Suppose you add a remote like this:
es: Supón que añades un remoto tal que:

source: You can do that in Git with `git read-tree`.
es: Se ha de lanzar el comando `git read-tree`.

source: With these basic commands, you can use the interactive add mode to deal with your staging area a little more easily.
es: Con estos comandos básicos, se ha visto cómo se puede emplear el modo interactivo para interactuar de forma más sencilla con el área de preparación.

source: The last thing you have to do is check that you’re not trying to push non-fast-forwarded references, but that is a bit less common.
es: El último aspecto a comprobar es el de no intentar enviar referencias que no sean de avance-rápido. Pero esto es algo más raro que suceda.

source: If you didn’t want it to be called `serverfix` on the remote, you could instead run `git push origin serverfix:awesomebranch` to push your local `serverfix` branch to the `awesomebranch` branch on the remote project.
es: Si no quieres que se llame 'serverfix' en el remoto, puedes lanzar, por ejemplo, 'git push origin serverfix:awesomebranch'; para llevar tu rama 'serverfix' local a la rama 'awesomebranch' en el proyecto remoto.

source: Normally, you get as the original commit the commit where you copied the code over, because that is the first time you touched those lines in this file.
es: Habitualmente suele mostrarse como confirmación de cambios original aquella confirmación de cambios desde la que se copió el código. Por ser esa la primera ocasión en que se han modificado las líneas en ese archivo.

source: You can also specify multiple refspecs.
es: Puedes incluso indicar multiples referencias en un solo comando.

source: Insert 18333fig0408.png Figure 4-8.
es: Insert 18333fig0408.png Figura 4-8.

source: Rebasing the change introduced in C3 onto C4.
es: Reorganizando sobre C4 los cambios introducidos en C3.

source: This is also a valid mbox e-mail format.
es: Es también un formato válido para un mbox.

source: Now you have two commits that you want to send to the mailing list.
es: Tienes dos confirmaciones de cambios (commits) a enviar a la lista de correo.

source: This setup should leave you with CRLF endings in Windows checkouts but LF endings on Mac and Linux systems and in the repository.
es: Este ajuste dejará los finales de línea CRLF en las extraciones de código (checkout), pero los finales LF en sistemas Mac o Linux y en el repositorio.

source: Then, you can see what the `master` branch on the `origin` remote was the last time you communicated with the server, by checking the `refs/remotes/origin/master` file:
es: Tras lo cual puedes confirmar cual era la rama `master` en el remoto `origin` la última vez que comunicase con el servidor. Comprobando el archivo `refs/remotes/origin/master`:

source: Your object is there, so go ahead and get the whole packfile:
es: Una vez comprobada la presencia del objeto, adelante con la recuperación de todo el archivo empaquetado:

source: ## Plumbing and Porcelain ##
es: ## Fontaneria y porcelana ##

source: This is most useful if you’re working with a person consistently.
es: Es muy util cuando trabajas regularmente con una persona.

source: Cool — now you have a branch named `recover-branch` that is where your `master` branch used to be, making the first two commits reachable again.
es: ¡Bravo!, acabas de añadir una rama denominada `recover-branch` al punto donde estaba originalmente tu rama `master`; permitiendo así recuperar el acceso a las dos primeras confirmaciones de cambios.

source: The first thing you should do is clone the external repository into your subdirectory.
es: La primera tarea a realizar es clonar el repositorio externo dento de una subcarpeta dentro del proyecto.

source: This does a one-time pull and doesn’t save the URL as a remote reference:
es: Esto efectua una recuperación (pull) puntual y no conserva la URL como una referencia remota:

source: Now, the snapshot pointed to by C3 is exactly the same as the one that was pointed to by C5 in the merge example.
es: Así, la instantánea apuntada por C3 aquí es exactamente la misma apuntada por C5 en el ejemplo de la fusión.

source: The downside of serving your repository over HTTP is that it’s relatively inefficient for the client.
es: La pega de servir un repositorio a través de HTTP es su relativa ineficiencia para el cliente.

source: We’ll quickly go over how that is done.
es: Vamos a ver cómo hacerlo.

source: I mentioned earlier that a header is stored with the content.
es: He citado anteriormente que siempre se almacena una cabecera junto al contenido.

source: The next section deals with projects that prefer to accept contributed patches via e-mail.
es: En la siguiente sección, veremos el caso de los proyectos que prefieren aceptar contribuciones a través del correo electrónico.

source: It’s used to inspect the snapshot that’s about to be committed, to see if you’ve forgotten something, to make sure tests run, or to examine whatever you need to inspect in the code.
es: Se suele utilizar para inspeccionar la instantánea (snapshot) que vas a confirmar, para ver si has olvidado algo, para asegurar que las pruebas se ejecutan, o para revisar cualquier aspecto que necesites inspeccionar en el codigo.

source: Lastly, you have this:
es: Y, por último, se ve:

source: They can add your repository as a remote, test your changes locally, merge them into their branch, and push back to their repository.
es: Ella podrá añadir tu repositorio como un remoto, chequear tus cambios localmente, fusionarlos (merge) con su rama y enviarlos (push) de vuelta a su repositorio.

source: By symbolic reference, I mean that unlike a normal reference, it doesn’t generally contain a SHA-1 value but rather a pointer to another reference.
es: Por referencia simbólica me refiero a que, a diferencia de una referencia normal, esta contiene un enlace a otra referencia en lugar de un valor SHA-1.

source: The main Source tab that you land on shows your project’s main directory listing and automatically renders the README file below it if you have one.
es: La pestaña principal "Source" en la que aterrizas cuando llegas al proyecto, muestra un listado de la carpeta principal; y muestra también el contenido del archivo README, si tienes uno en ella.

source: You can also do this with content in files.
es: Lo puedes hacer también con el propio contenido de los archivos.

source: A short and simple commit history.
es: Un registro de confirmaciones simple y corto.

source: Jessica’s repository looks like Figure 5-12.
es: Quedando su repositorio como se muestra en la Figura 5-12

source: The `+` tells Git to update the reference even if it isn’t a fast-forward.
es: El `+`, si está presente, indica a Git que debe actualizar la referencia incluso en los casos en que no se dé un avance rápido (fast-forward).

source: If you want an attribute like bold in the previous example, you can choose from bold, dim, ul, blink, and reverse.
es: También puedes aplicar atributos tales como 'bold' (negrita), 'dim' (tenue), 'ul' ( ), 'blink' (parpadeante) y 'reverse (video inverso).

source: It starts with the 4 bytes specifying how much data is following, then the command to run followed by a null byte, and then the server’s hostname followed by a final null byte.
es: Como siempre, comienza con 4 bytes indicadores de cuantos datos siguen a continuación, siguiendo con el comando a lanzar, y terminando con un byte nulo, el nombre del servidor y otro byte nulo más.

source: For example, if you want to change the last three commit messages, or any of the commit messages in that group, you supply as an argument to `git rebase -i` the parent of the last commit you want to edit, which is `HEAD~2^` or `HEAD~3`.
es: Por ejemplo, para modificar las tres últimas confirmaciones de cambios, se indicara el padre de la última conformación a modificar, es decir habrá que escribir `HEAD~2^` or `HEAD~3` tras el comando `git rebase -i`.

source: It lets you edit the default message before the commit author sees it.
es: Te permite editar el mensaje por defecto, antes de que lo vea el autor de la confirmación de cambios.

source: It’s important to note that when you do a fetch that brings down new remote branches, you don’t automatically have local, editable copies of them.
es: Es importante destacar que cuando recuperas (fetch) nuevas ramas remotas, no obtienes automáticamente una copia editable local de las mismas.

source: Set up a merge wrapper script named `extMerge` that calls your binary with all the arguments provided:
es: El primer script a preparar es uno al que denominaremos 'extMerge', para llamar al ejecutable con los correspodientes argumentos:

source: To see what packfiles are available on this server, you need to get the `objects/info/packs` file, which contains a listing of them (also generated by `update-server-info`):
es: Para ver que empaquetados hay disponibles en el servidor, has de recuperar el archivo `objects/info/packs`. Este contiene una lista de todos ellos: (que ha sido generada por `update-server-info`)

source: If you want to version-control Word documents, you can stick them in a Git repository and commit every once in a while; but what good does that do?
es: Si deseas controlar versiones en documentos Word, puedes añadirlos a un repositorio Git e ir realizando confirmaciones de cambio (commit) cada vez. Pero, ¿qué ganas con ello?.

source: This looks a bit different than the `hotfix` merge you did earlier.
es: Es algo diferente de la fusión realizada anteriormente con 'hotfix'.

source: But you have already set up your repositories in `/opt/git`, so instead of reconfiguring everything, you create a symlink:
es: Pero si, en lugar de en esa, has instalado tus repositorios bajo la carpeta '/opt/git'. Sin necesidad de reconfigurarlo todo, tan solo has de crear un enlace virtual:

source: ## An Example Git-Enforced Policy ##
es: ## Un ejemplo de implantación de una determinada política en Git ##

source: Remember again that this is a rebasing command — every commit included in the range `HEAD~3..HEAD` will be rewritten, whether you change the message or not.
es: Es importante avisar de nuevo que se trata de un comando de reorganización: todas y cada una de las confirmaciones de cambios en el rango `HEAD~3..HEAD` van a ser reescritas, (cambia su código SHA-1), tanto si se modifica algo en ellas como si no.

source: Is a lieutenant system in place, and do you have to submit your work to them first?
es: ¿Existe un sistema de tenientes, a los que has de enviar tu trabajo en primer lugar?.

source: ### The HTTP/S Protocol ###
es: ### El protocolo HTTP/S ###

source: You can also set the value of HEAD:
es: Y también puedes cambiar el valor de HEAD a través de él:

source: In this section, we’ll cover some common workflows that this lightweight branching makes possible, so you can decide if you would like to incorporate it into your own development cycle.
es: En este apartado vamos a ver algunos de los flujos de trabajo más comunes, de tal forma que puedas decidir si te gustaría incorporar alguno de ellos a tu ciclo de desarrollo.

source: In this scenario, you have a `master` branch that contains basically stable code.
es: En este escenario, tienes una rama 'master' que contiene, principalmente, código estable.

source: To synchronize your work, you run a `git fetch origin` command.
es: Para sincronizarte, puedes utilizar el comando 'git fetch origin'.

source: You may want to use `rebase -i` to squash your work down to a single commit, or rearrange the work in the commits to make the patch easier for the maintainer to review — see Chapter 6 for more information about interactive rebasing.
es: Puedes querer utilizar 'rebase -i' para reducir tu trabajo a una sola confirmación de cambios (commit), o reorganizar el trabajo en las diversas confirmaciones para facilitar la revisión de parche por parte del gestor del proyecto --ver el Capítulo 6 para más detalles sobre reorganizaciones interactivas--.

source: All these questions can affect how you contribute effectively to a project and what workflows are preferred or available to you.
es: Todas estas preguntas afectan a la forma efectiva de contribuir a un proyecto, y a la forma de trabajo que prefieras o esté disponible para tí.

source: Merging contributed topic branches into long-term integration branches.
es: Fusionando aportaciones de ramas puntuales en ramas de más largo recorrido.

source: In the context of the `diff` command, you can put three periods after another branch to do a `diff` between the last commit of the branch you’re on and its common ancestor with another branch:
es: Estando en el contexto del comando 'diff', puedes indicar tres puntos entre los nombres de las dos ramas; para comparar entre la última confirmación de cambios de la rama donde estás y la respectiva confirmación común con la otra rama:

source: Boom.
es: Y....Boom!.

source: You can also manually edit this file, but again a safer command exists to do so: `symbolic-ref`.
es: Puedes editar manualmente este archivo. Pero, también para esta tarea existe un comando más seguro: `symbolic-ref`.

source: At this stage, you’ll receive a call that another issue is critical and you need a hotfix.
es: En este momento, recibes una llamada avisandote de un problema crítico que has de resolver.

source: The presence of that file tells Git that it’s OK to serve this project without authentication.
es: La presencia de este archivo, indica a Git que está permitido el servir este proyecto sin necesidad de autentificación.

source: If you want to back up or clone your repository, copying this single directory elsewhere gives you nearly everything you need.
es: Si deseas hacer una copia de seguridad de tu repositorio, con tan solo copiar esta carpeta a cualquier otro lugar ya tienes tu copia completa.

source: I found that learning this information was fundamentally important to understanding how useful and powerful Git is, but others have argued to me that it can be confusing and unnecessarily complex for beginners.
es: Me parece que esta información es realmente importante para entender cúan util y potente es Git. Pero algunas personas opinan que puede ser confuso e innecesariamente complejo para novatos.

source: When your branch work is finished and you’re ready to contribute it back to the maintainers, go to the original project page and click the "Fork" button, creating your own writable fork of the project.
es: Cuando el trabajo en tu rama puntual está terminado y estás listo para enviarlo al gestor del proyecto, vete a la página del proyecto original y clica sobre el botón "Fork" (bifurcar), para crear así tu propia copia editable del proyecto.

source: Say you have a database settings file called database.xml that is different in two branches, and you want to merge in your other branch without messing up the database file.
es: Digamos que tienes un archivo de datos denominado database.xml, distinto en las dos ramas, y que deseas fusionar en la otra rama sin perturbarlo.

source: To create an index with a single entry — the first version of your text.txt file — you can use the plumbing command `update-index`.
es: Puedes utilizar el comando de "fontaneria" `update-index` para crear un índice con una sola entrada, --la primera version de tu archivo text.txt--.

source: Simply set it to the path of a file that has content similar to what a `.gitignore` file would have.
es: Simplemente, configuralo para que apunte a un archivo con contenido similar al que tendría cualquier archivo '.gitignore'.

source: Now, Git won’t try to convert or fix CRLF issues; nor will it try to compute or print a diff for changes in this file when you run git show or git diff on your project.
es: A partir de ahora, Git no intentará convertir ni corregir problemas CRLF en los finales de línea; ni intentará hacer comparaciones ni mostar diferencias de este archivo cuando lances comandos 'git show' o 'git diff' en tu proyecto.

source: If you can, try to make your changes digestible — don’t code for a whole weekend on five different issues and then submit them all as one massive commit on Monday.
es: Siempre que te sea posible, intenta hacer digeribles tus cambios --no estés trabajando todo el fin de semana, sobre cuatro o cinco asuntos diferentes, y luego confirmes todo junto el lunes--.

source: You have to either move it out of the way or remove it, in which case you have to clone it again when you switch back—and you may lose local changes or branches that you didn’t push up.
es: Forzandonos a removerla del camino. Lo cual obliga a volver a clonarla cuando se retome la rama inicial --con la consiguiente pérdida de los cambios locales si estos no habian sido enviados previamente al servidor--.

source: Because Git uses a simple three-way merge, merging from one branch into another multiple times over a long period is generally easy to do.
es: Por la sencillez de la fusión a tres bandas de Git, el fusionar de una rama a otra multitud de veces a lo largo del tiempo es facil de hacer.

source: Git can use four major network protocols to transfer data: Local, Secure Shell (SSH), Git, and HTTP.
es: Git puede usar cuatro protocolos principales para transferir datos: Local, Secure Shell (SSH), Git y HTTP.

source: First, you need to require the library and then run `Zlib::Deflate.deflate()` on the content:
es: Primero has de incluir la libreria y luego lanzar la orden `Zlib::Deflate.deflate()` sobre el contenido:

source: Insert 18333fig0303.png Figure 3-3.
es: Insert 18333fig0303.png Figura 3-3.

source: If the pusher is trying to push to multiple branches, `pre-receive` runs only once, whereas update runs once per branch they’re pushing to.
es: Si la persona que realiza el envio intenta actualizar varias ramas, 'pre-receive' se ejecuta una sola vez, mientras que 'update' se ejecuta tantas veces como ramas se estén actualizando.

source: Insert 18333fig0902.png Figure 9-2.
es: Insert 18333fig0902.png Figura 9-2.

source: You’ve halved your disk usage by packing your objects.
es: Empaquetando los objetos, has conseguido reducir a la mitad el uso de disco.

source: The workflow is similar to the previous use case — you create topic branches for each patch series you work on.
es: El flujo de trabajo es similar a los casos de uso vistos anteriormente; --creando ramas puntuales para cada serie de parches en los que vayas a trabajar--.

source: If you’ve used keyword substitution in CVS or Subversion, you can include a datestamp — the SHA isn’t all that helpful, because it’s fairly random and you can’t tell if one SHA is older or newer than another.
es: Si has utilizado alguna vez las sustituciones de CVS o de Subversion, sabrás que pueden incluir una marca de fecha, --la suma de comprobación SHA no es igual de util, ya que, por ser bastante aleatoria, es imposible deducir si una suma SHA es anterior o posterior a otra--.

source: A simple way to get the commit message from a commit when you have the SHA-1 value is to go to the first blank line and take everything after that.
es: Una vía sencilla para obtener el mensaje, es la de ir hasta la primera línea en blanco y luego coger todo lo que siga a esta.

source: You’ve effectively lost the top two commits — you have no branch from which those commits are reachable.
es: Vemos que se han perdido las dos últimas confirmaciones de cambios, --no tienes ninguna rama que te permita acceder a ellas--.

source: Here’s an example to give you an idea of what it would take to get a SHA-1 collision.
es: El siguiente ejemplo puede ser bastante ilustrativo, para hacernos una idea de lo que podría tardarse en darse una colisión en el código SHA-1:

source: Insert 18333fig0507.png Figure 5-7.
es: Insert 18333fig0507.png Figura 5-7.

source: The changes to your files were reapplied, but the file you staged before wasn’t restaged.
es: Las modificaciones sobre los archivos serán aplicadas; pero no así el estado de preparación.

source: If you run it with the `--full` option, it shows you all objects that aren’t pointed to by another object:
es: Si lo lanzas con la opción `--full`, te mostrará todos los objetos sin referencias a ningún otro objeto:

source: You can also use interactive rebases to reorder or remove commits entirely.
es: Las reorganizaciones interactivas también se pueden emplear para reordenar o para eliminar completamente ciertas confirmaciones de cambios (commits).
